Revit 2027 API
PointCloudOverrideSettings.IsEqual Method
 Checks if the contents of two settings are equal.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	PointCloudOverrideSettings other
)
Public Function IsEqual (
	other As PointCloudOverrideSettings
) As Boolean
public:
bool IsEqual(
	PointCloudOverrideSettings^ other
)
member IsEqual :
        other : PointCloudOverrideSettings -> bool
Parameters
other PointCloudOverrideSettings
 The settings to be compared.
Return Value
Boolean
 True for equal, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace